##Написать три декоратора, каждый декоратор выводит свое имя, так, чтобы можно было написать их один над другим:
##@first_decorator
##@second_decorator
##@third_decorator
##def foo(*args, **kwargs):
##    print(args, kwargs)
##    

def first_dec(a):
    pass


def second_dec(a)

